## Plan Result (stg_appgw)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.appgw
  * azurerm_user_assigned_identity.this
* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg"
        name                              = "crime-portal-appgw-stg"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - frontend_port {
          - id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/test" -> null
          - name = "test" -> null
          - port = 81 -> null
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/test" -> null
          - frontend_port_name             = "test" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/test-listener" -> null
          - name                           = "test-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "crime-portal-uat-ssl-cert"
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ trusted_root_certificate {
          - data                = (sensitive value) -> null
            id                  = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/trustedRootCertificates/crime-portal-uat"
          + key_vault_secret_id = "https://crime-portal-kv-stg.vault.azure.net/secrets/crime-portal-root-certificate/53dba5bdf0e0451a9271ed62e8da95be"
            name                = "crime-portal-uat"
        }

        # (15 unchanged blocks hidden)
    }

  # azurerm_key_vault_access_policy.appgw will be created
  + resource "azurerm_key_vault_access_policy" "appgw" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.KeyVault/vaults/crime-portal-kv-stg"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "crime-portal-appgw-stg-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "crime-portal-rg-stg"
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"stg_appgw","Vars":{}} -->